devdnl/dnx-rtos/src/system/drivers/usbh/stm32f4/usbh.c
        int err = sys_mutex_lock(hdl->mtx, MAX_DELAY_MS);
        if (!err) {

                if (hdl->class_active) {

                        bool unaligned = hdl->hhcd.Init.dma_enable
                                         && (  ((uintptr_t)src % _HEAP_ALIGN_)
                                            || !sys_is_mem_dma_capable(src) );

                        if (unaligned) {
                                DEBUG("write from unaligned source pointer");
                        }

                        *wrcnt = 0;

                        while (!err && count) {

                                size_t len = unaligned ? min(count, sizeof(hdl->buffer)) : count;

                                if (unaligned) {
                                        if (_DMA_DDI_memcpy(hdl->buffer, src, len) != 0) {
                                                DEBUG("DMA M2M transfer fail!");
                                                memcpy(hdl->buffer, src, len);
                                        }
                                }

                                u8_t *buf = unaligned ? hdl->buffer : const_cast(src);
                                uint32_t sector_count = len / SECTOR_SIZE;
                                uint32_t sector_addr  = (*fpos / SECTOR_SIZE);

                                for (int try = 0; try < 3; try ++) {
                                        err = USBH_MSC_Write(&hdl->hUSBHost, 0, sector_addr, buf, sector_count);
                                        if (!err) {
                                                src    += len;
                                                *fpos  += len;
                                                *wrcnt += len;
                                                count  -= len;
                                                break;

                                        } else {
                                                MSC_LUNTypeDef info;
                                                USBH_MSC_GetLUNInfo(&hdl->hUSBHost, 0, &info);

                                                switch (info.sense.asc) {
                                                case SCSI_ASC_WRITE_PROTECTED:
                                                        printk("USBH: USB Disk is Write protected!");
                                                        err = EROFS;
                                                        try = UINT8_MAX;
                                                        break;

                                                case SCSI_ASC_LOGICAL_UNIT_NOT_READY:
                                                case SCSI_ASC_MEDIUM_NOT_PRESENT:
                                                case SCSI_ASC_NOT_READY_TO_READY_CHANGE:
                                                        printk("USBH: WR USB Disk is not ready! (%u)", info.sense.asc);
                                                        err = recovery_usb_connection(hdl);
                                                        if (err) {
                                                                try = UINT8_MAX;
                                                        }
                                                        break;

                                                default:
                                                        err = EIO;
                                                        try = UINT8_MAX;
                                                        break;
                                                }
                                        }
                                }
                        }
                } else {
                        err = ENOMEDIUM;
                }

                sys_mutex_unlock(hdl->mtx);
        }

        return err;
}

//==============================================================================
/**
 * @brief Read data from device.
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *rdcnt                  number of read bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h).
 */
//==============================================================================
API_MOD_READ(USBH,
             void            *device_handle,
             u8_t            *dst,
             size_t           count,
             fpos_t          *fpos,
             size_t          *rdcnt,
             struct vfs_fattr fattr)
{
        UNUSED_ARG1(fattr);

        USBH_t *hdl = device_handle;

        if ((count & 0x1FF) || (*fpos & 0x1FF)) {
                return EINVAL;
        }

        int err = sys_mutex_lock(hdl->mtx, MAX_DELAY_MS);
        if (!err) {

                if (hdl->class_active) {

                        bool unaligned = hdl->hhcd.Init.dma_enable
                                         && (  ((uintptr_t)dst % _HEAP_ALIGN_)
                                            || !sys_is_mem_dma_capable(dst) );

                        if (unaligned) {
                                DEBUG("read to unaligned destination pointer");
                        }

                        *rdcnt = 0;

                        while (!err && count) {

                                size_t len = unaligned ? min(count, sizeof(hdl->buffer)) : count;

                                u8_t *buf = unaligned ? hdl->buffer : dst;
                                uint32_t sector_count = len / SECTOR_SIZE;
                                uint32_t sector_addr  = (*fpos / SECTOR_SIZE);

                                for (int try = 0; try < 3; try ++) {
                                        err = USBH_MSC_Read(&hdl->hUSBHost, 0, sector_addr, buf, sector_count);
                                        if (!err) {
                                                if (unaligned) {
                                                        if (_DMA_DDI_memcpy(dst, hdl->buffer, len) != 0) {
                                                                DEBUG("DMA M2M transfer fail!");
                                                                memcpy(dst, hdl->buffer, len);
                                                        }
                                                }

                                                dst    += len;
                                                *fpos  += len;
                                                *rdcnt += len;
                                                count  -= len;
                                                break;

                                        } else {
                                                MSC_LUNTypeDef info;
                                                USBH_MSC_GetLUNInfo(&hdl->hUSBHost, 0, &info);

                                                switch (info.sense.asc) {
                                                case SCSI_ASC_LOGICAL_UNIT_NOT_READY:
                                                case SCSI_ASC_MEDIUM_NOT_PRESENT:
                                                case SCSI_ASC_NOT_READY_TO_READY_CHANGE:
                                                        printk("USBH: RD USB Disk is not ready!");
                                                        err = recovery_usb_connection(hdl);
                                                        if (err) {
                                                                try = UINT8_MAX;
                                                        }
                                                        break;

                                                default:
                                                        err = EIO;
                                                        try = UINT8_MAX;
                                                        break;
                                                }
                                        }
                                }
                        }
                } else {
                        err = ENOMEDIUM;
                }

                sys_mutex_unlock(hdl->mtx);
        }

