devdnl/dnx-rtos/src/system/drivers/usbh/stm32f4/usbh.c
                /* Enable USB HS Clocks */
                SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_OTGHSEN);

                /* Set USBHS Interrupt to the lowest priority */
                NVIC_SetPriority(OTG_HS_IRQn, _CPU_IRQ_SAFE_PRIORITY_);

                /* Enable USBHS Interrupt */
                NVIC_EnableIRQ(OTG_HS_IRQn);
        }
}

//==============================================================================
/**
 * @brief  DeInitializes the HCD MSP.
 * @param  hhcd: HCD handle
 * @retval None
 */
//==============================================================================
void HAL_HCD_MspDeInit(HCD_HandleTypeDef *hhcd)
{
        if (hhcd->Instance == USB_OTG_FS) {
                /* Disable USB FS Clocks */
                CLEAR_BIT(RCC->AHB2ENR, RCC_AHB2ENR_OTGFSEN);

                /* Disable USBFS Interrupt */
                NVIC_DisableIRQ(OTG_FS_IRQn);

        } else if (hhcd->Instance == USB_OTG_HS) {
                /* Enable USB HS Clocks */
                CLEAR_BIT(RCC->AHB1ENR, RCC_AHB1ENR_OTGHSEN);

                /* Enable ULPI clock */
                CLEAR_BIT(RCC->AHB1ENR, RCC_AHB1ENR_OTGHSULPIEN);

                /* Disable USBHS Interrupt */
                NVIC_DisableIRQ(OTG_HS_IRQn);
        }
}

/*******************************************************************************
                       LL Driver Callbacks (HCD -> USB Host Library)
*******************************************************************************/
//==============================================================================
/**
 * @brief  SOF callback.
 * @param  hhcd: HCD handle
 * @retval None
 */
//==============================================================================
void HAL_HCD_SOF_Callback(HCD_HandleTypeDef *hhcd)
{
        USBH_LL_IncTimer(hhcd->pData);
}

//==============================================================================
/**
 * @brief  Connect callback.
 * @param  hhcd: HCD handle
 * @retval None
 */
//==============================================================================
void HAL_HCD_Connect_Callback(HCD_HandleTypeDef *hhcd)
{
        USBH_LL_Connect(hhcd->pData);
}

//==============================================================================
/**
 * @brief  Disconnect callback.
 * @param  hhcd: HCD handle
 * @retval None
 */
//==============================================================================
void HAL_HCD_Disconnect_Callback(HCD_HandleTypeDef *hhcd)
{
        USBH_LL_Disconnect(hhcd->pData);
}

//==============================================================================
/**
 * @brief  Port Port Enabled callback.
 * @param  hhcd: HCD handle
 * @retval None
 */
//==============================================================================
void HAL_HCD_PortEnabled_Callback(HCD_HandleTypeDef *hhcd)
{
        USBH_LL_PortEnabled(hhcd->pData);
}

//==============================================================================
/**
 * @brief  Port Port Disabled callback.
 * @param  hhcd: HCD handle
 * @retval None
 */
//==============================================================================
void HAL_HCD_PortDisabled_Callback(HCD_HandleTypeDef *hhcd)
{
        USBH_LL_PortDisabled(hhcd->pData);
}

//==============================================================================
/**
 * @brief  Notify URB state change callback.
 * @param  hhcd: HCD handle
 * @param  chnum: Channel number
 * @param  urb_state: URB State
 * @retval None
 */
//==============================================================================
void HAL_HCD_HC_NotifyURBChange_Callback(HCD_HandleTypeDef *hhcd, uint8_t chnum, HCD_URBStateTypeDef urb_state)
{
        UNUSED_ARG2(chnum, urb_state);
#if (USBH_USE_OS == 1)
        USBH_LL_NotifyURBChange(hhcd->pData);
#endif
}

/*******************************************************************************
                       LL Driver Interface (USB Host Library --> HCD)
*******************************************************************************/
//==============================================================================
/**
 * @brief  USBH_LL_Init
 *         Initialize the Low Level portion of the Host driver.
 * @param  phost: Host handle
 * @retval USBH Status
 */
//==============================================================================
USBH_StatusTypeDef USBH_LL_Init(USBH_HandleTypeDef *phost)
{
        USBH_t *hdl = usbh;

#ifdef USE_USB_FS
        /* Set the LL Driver parameters */
        hdl->hhcd.Instance = USB_OTG_FS;
        hdl->hhcd.Init.Host_channels = 11;
        hdl->hhcd.Init.dma_enable = 0;
        hdl->hhcd.Init.low_power_enable = 0;
        hdl->hhcd.Init.phy_itface = HCD_PHY_EMBEDDED;
        hdl->hhcd.Init.Sof_enable = 0;
        hdl->hhcd.Init.speed = HCD_SPEED_FULL;
        hdl->hhcd.Init.vbus_sensing_enable = 0;
        hdl->hhcd.Init.lpm_enable = 0;

        /* Link the driver to the stack */
        hdl->hhcd.pData = phost;
        phost->pData = &hdl->hhcd;

        /* Initialize the LL Driver */
        HAL_HCD_Init(&hdl->hhcd);
#endif
#ifdef USE_USB_HS
        /* Set the LL driver parameters */
        hdl->hhcd.Instance = USB_OTG_HS;
        hdl->hhcd.Init.Host_channels = 11;
        hdl->hhcd.Init.dma_enable = 1;
        hdl->hhcd.Init.low_power_enable = 0;
        hdl->hhcd.Init.phy_itface = HCD_PHY_ULPI;
        hdl->hhcd.Init.Sof_enable = 0;
        hdl->hhcd.Init.speed = HCD_SPEED_HIGH;
        hdl->hhcd.Init.vbus_sensing_enable = 0;
        hdl->hhcd.Init.use_external_vbus = 1;
        hdl->hhcd.Init.lpm_enable = 0;

        /* Link the driver to the stack */
        hdl->hhcd.pData = phost;
        phost->pData = &hdl->hhcd;
        /* Initialize the LL driver */
        HAL_HCD_Init(&hdl->hhcd);
#endif /*USE_USB_HS*/

        USBH_LL_SetTimer(phost, HAL_HCD_GetCurrentFrame(&hdl->hhcd));

        return USBH_OK;
}

//==============================================================================
/**
 * @brief  USBH_LL_DeInit
 *         De-Initialize the Low Level portion of the Host driver.
 * @param  phost: Host handle
 * @retval USBH Status
 */
//==============================================================================
USBH_StatusTypeDef USBH_LL_DeInit(USBH_HandleTypeDef *phost)
{
        HAL_HCD_DeInit(phost->pData);
        return USBH_OK;
}

//==============================================================================
/**
 * @brief  USBH_LL_Start
 *         Start the Low Level portion of the Host driver.
 * @param  phost: Host handle
 * @retval USBH Status
 */
//==============================================================================
USBH_StatusTypeDef USBH_LL_Start(USBH_HandleTypeDef *phost)
{
        HAL_HCD_Start(phost->pData);
        return USBH_OK;
}

//==============================================================================
/**
 * @brief  USBH_LL_Stop
 *         Stop the Low Level portion of the Host driver.
 * @param  phost: Host handle
 * @retval USBH Status
 */
//==============================================================================
USBH_StatusTypeDef USBH_LL_Stop(USBH_HandleTypeDef *phost)
{
        HAL_HCD_Stop(phost->pData);
        return USBH_OK;
}

//==============================================================================
/**
 * @brief  USBH_LL_GetSpeed
 *         Return the USB Host Speed from the Low Level Driver.
 * @param  phost: Host handle
 * @retval USBH Speeds
 */
//==============================================================================
USBH_SpeedTypeDef USBH_LL_GetSpeed(USBH_HandleTypeDef *phost)
{
        USBH_SpeedTypeDef speed = USBH_SPEED_FULL;

