devdnl/dnx-rtos/src/system/drivers/usbh/stm32f4/usbh.c
        if(hdl->hhcd.hc[pipe].ep_is_in) {
                hdl->hhcd.hc[pipe].toggle_in = toggle;
        } else {
                hdl->hhcd.hc[pipe].toggle_out = toggle;
        }

        return USBH_OK;
}

//==============================================================================
/**
 * @brief  USBH_LL_GetToggle
 *         Return the current toggle of a pipe.
 * @param  phost: Host handle
 * @param  pipe: Pipe index
 * @retval toggle (0/1)
 */
//==============================================================================
uint8_t USBH_LL_GetToggle(USBH_HandleTypeDef *phost, uint8_t pipe)
{
        UNUSED_ARG1(phost);

        USBH_t *hdl = usbh;

        uint8_t toggle = 0;

        if(hdl->hhcd.hc[pipe].ep_is_in) {
                toggle = hdl->hhcd.hc[pipe].toggle_in;
        } else {
                toggle = hdl->hhcd.hc[pipe].toggle_out;
        }

        return toggle;
}

//==============================================================================
/**
 * @brief  USBH_Delay
 *         Delay routine for the USB Host Library
 * @param  Delay: Delay in ms
 * @retval None
 */
//==============================================================================
void USBH_Delay(uint32_t Delay)
{
        sys_sleep_ms(Delay);
}

//==============================================================================
/**
 * @brief  Memory allocation function used in USB host library.
 *
 * @param  size         block size
 *
 * @return Block address.
 */
//==============================================================================
void *USBH_malloc(uint32_t size)
{
        void *mem = NULL;
        int err = sys_zalloc2(size, NULL, _MM_FLAG__DMA_CAPABLE, _MM_FLAG__DMA_CAPABLE, &mem);
        return !err ? mem : NULL;
}

//==============================================================================
/**
 * @brief  Memory free function used in USB host library.
 *
 * @param  mem          block to free
 */
//==============================================================================
void USBH_free(void *mem)
{
        sys_free(&mem);
}

//==============================================================================
/**
 * @brief  USB HS IRQ handler
 */
//==============================================================================
void CAN3_SCE_OTG_HS_IRQHandler(void)
{
        if (usbh) {
                usbh_irq = true;
                HAL_HCD_IRQHandler(&usbh->hhcd);
                usbh_irq = false;

                if (usbh->irq_ctr > 1000000) {
                        //HAL_HCD_MspDeInit(&usbh->hhcd);
                }
        }
}

/*==============================================================================
  End of file
==============================================================================*/
